In [1]:
# import essential libraries
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/amazon_fires.csv",encoding='ISO-8859-1')
df

       ano       mes     estado   numero  encontro
0     1998   Janeiro       Acre  0 Fires  1/1/1998
1     1999   Janeiro       Acre  0 Fires  1/1/1999
2     2000   Janeiro       Acre  0 Fires  1/1/2000
3     2001   Janeiro       Acre  0 Fires  1/1/2001
4     2002   Janeiro       Acre  0 Fires  1/1/2002
...    ...       ...        ...      ...       ...
6449  2012  Dezembro  Tocantins      128  1/1/2012
6450  2013  Dezembro  Tocantins       85  1/1/2013
6451  2014  Dezembro  Tocantins      223  1/1/2014
6452  2015  Dezembro  Tocantins      373  1/1/2015
6453  2016  Dezembro  Tocantins      119  1/1/2016

[6454 rows x 5 columns]

In [3]:
df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

# Rename the column-
    - var = {'old_col': 'new_col'}
    - df.rename(columns=var,inplace=True)

In [4]:
# single column rename
d = {'ano':'year'}
df.rename(columns=d,inplace=True)
df.head()

   year      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [5]:
# multiple column rename
d = {'ano':'year','encontro':'date'}
df.rename(columns=d,inplace=True)
df.head()

   year      mes estado   numero      date
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [6]:
# multiple column rename
d = {'ano':'year','mes':'month','estado':'states','numero':'no_of_fires'}
df.rename(columns=d,inplace=True)
df.head()

   year    month states no_of_fires      date
0  1998  Janeiro   Acre     0 Fires  1/1/1998
1  1999  Janeiro   Acre     0 Fires  1/1/1999
2  2000  Janeiro   Acre     0 Fires  1/1/2000
3  2001  Janeiro   Acre     0 Fires  1/1/2001
4  2002  Janeiro   Acre     0 Fires  1/1/2002

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         6454 non-null   int64
 1   month        6454 non-null   object
 2   states       6454 non-null   object
 3   no_of_fires  6322 non-null   object
 4   date         6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [8]:
df.drop_duplicates(inplace=True)
df.head()

   year    month states no_of_fires      date
0  1998  Janeiro   Acre     0 Fires  1/1/1998
1  1999  Janeiro   Acre     0 Fires  1/1/1999
2  2000  Janeiro   Acre     0 Fires  1/1/2000
3  2001  Janeiro   Acre     0 Fires  1/1/2001
4  2002  Janeiro   Acre     0 Fires  1/1/2002

In [9]:
df.iloc[2:88:,1:4]

      month states no_of_fires
2   Janeiro   Acre     0 Fires
3   Janeiro   Acre     0 Fires
4   Janeiro   Acre     0 Fires
5   Janeiro   Acre    10 Fires
6   Janeiro   Acre     0 Fires
..      ...    ...         ...
83     Maio   Acre     0 Fires
84     Maio   Acre     0 Fires
85     Maio   Acre     6 Fires
86     Maio   Acre     7 Fires
87     Maio   Acre     2 Fires

[86 rows x 3 columns]

# Changing the data in a column
    - var = {'old_data':'new_data'}
    - df.['col_name']=df['col_name']map(var)

In [10]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [11]:
d = {'Janeiro':'jan','Fevereiro':'feb','Março':'march','Abril':'April','Maio':'may','Junho':'june','Julho':'july','Agosto':'Aug','Setembro':'sep','Outubro':'oct','Novembro':'nov','Dezembro':'dec'}
df['month'] = df['month'].map(d)
df.head()

   year month states no_of_fires      date
0  1998   jan   Acre     0 Fires  1/1/1998
1  1999   jan   Acre     0 Fires  1/1/1999
2  2000   jan   Acre     0 Fires  1/1/2000
3  2001   jan   Acre     0 Fires  1/1/2001
4  2002   jan   Acre     0 Fires  1/1/2002

In [12]:
df['month'].unique()

array(['jan', 'feb', 'march', 'April', 'may', 'june', 'july', 'Aug',
       'sep', 'oct', 'nov', 'dec'], dtype=object)

# Removing unwantended presenr in column
    - df['col_name'] = df['colu_name'].str.strip('unwanted data')

In [13]:
df['no_of_fires'].unique()

array(['0 Fires', '10 Fires', '12 Fires', ..., '2.032', '833', '623'],
      shape=(1729,), dtype=object)

In [14]:
df['no_of-fires'] = df['no_of_fires'].str.strip('fires')
df

      year month     states no_of_fires      date no_of-fires
0     1998   jan       Acre     0 Fires  1/1/1998         0 F
1     1999   jan       Acre     0 Fires  1/1/1999         0 F
2     2000   jan       Acre     0 Fires  1/1/2000         0 F
3     2001   jan       Acre     0 Fires  1/1/2001         0 F
4     2002   jan       Acre     0 Fires  1/1/2002         0 F
...    ...   ...        ...         ...       ...         ...
6449  2012   dec  Tocantins         128  1/1/2012         128
6450  2013   dec  Tocantins          85  1/1/2013          85
6451  2014   dec  Tocantins         223  1/1/2014         223
6452  2015   dec  Tocantins         373  1/1/2015         373
6453  2016   dec  Tocantins         119  1/1/2016         119

[6424 rows x 6 columns]

In [15]:
df['month'] = df['month'].str.upper()
df.head()

   year month states no_of_fires      date no_of-fires
0  1998   JAN   Acre     0 Fires  1/1/1998         0 F
1  1999   JAN   Acre     0 Fires  1/1/1999         0 F
2  2000   JAN   Acre     0 Fires  1/1/2000         0 F
3  2001   JAN   Acre     0 Fires  1/1/2001         0 F
4  2002   JAN   Acre     0 Fires  1/1/2002         0 F

In [16]:
df['month'] = df['month'].str.lower()
df.head()

   year month states no_of_fires      date no_of-fires
0  1998   jan   Acre     0 Fires  1/1/1998         0 F
1  1999   jan   Acre     0 Fires  1/1/1999         0 F
2  2000   jan   Acre     0 Fires  1/1/2000         0 F
3  2001   jan   Acre     0 Fires  1/1/2001         0 F
4  2002   jan   Acre     0 Fires  1/1/2002         0 F

In [17]:
# Deleting all null values
# syntax-
    # var.dropna(inplace=True)
import pandas as pd
import numpy as np

data = {
    'name': ['Ankit', 'Rohan', 'Priya', 'Suman', 'Aman', 'Neha', 'Vikas', 'Ritu', 'Pooja', 'Karan'],
    'rollno': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'marks': [85, None, 76, 90, 55, None, 67, 88, None, 72]
}

df1 = pd.DataFrame(data)

#print(df1)
df1

    name  rollno  marks
0  Ankit       1   85.0
1  Rohan       2    NaN
2  Priya       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6    NaN
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9    NaN
9  Karan      10   72.0

In [18]:
df1.dropna(inplace=True)
df1

    name  rollno  marks
0  Ankit       1   85.0
2  Priya       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
6  Vikas       7   67.0
7   Ritu       8   88.0
9  Karan      10   72.0

In [19]:
df

      year month     states no_of_fires      date no_of-fires
0     1998   jan       Acre     0 Fires  1/1/1998         0 F
1     1999   jan       Acre     0 Fires  1/1/1999         0 F
2     2000   jan       Acre     0 Fires  1/1/2000         0 F
3     2001   jan       Acre     0 Fires  1/1/2001         0 F
4     2002   jan       Acre     0 Fires  1/1/2002         0 F
...    ...   ...        ...         ...       ...         ...
6449  2012   dec  Tocantins         128  1/1/2012         128
6450  2013   dec  Tocantins          85  1/1/2013          85
6451  2014   dec  Tocantins         223  1/1/2014         223
6452  2015   dec  Tocantins         373  1/1/2015         373
6453  2016   dec  Tocantins         119  1/1/2016         119

[6424 rows x 6 columns]

In [20]:


data = {
    'name': ['Ankit', 'Rohan',None,  'Suman', 'Aman', 'Neha', 'Vikas', 'Ritu', 'Pooja', 'Karan'],
    'rollno': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'marks': [85, None, 76, 90, 55, None, 67, 88, None, 72]
}

df1 = pd.DataFrame(data)

#print(df1)
df1

    name  rollno  marks
0  Ankit       1   85.0
1  Rohan       2    NaN
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6    NaN
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9    NaN
9  Karan      10   72.0

In [21]:
# Filling null values
# syntax
#          var['col_name'] =var['col_name'].filling(values)
df1['name'] = df1['name'].fillna('Unknown')
df1

      name  rollno  marks
0    Ankit       1   85.0
1    Rohan       2    NaN
2  Unknown       3   76.0
3    Suman       4   90.0
4     Aman       5   55.0
5     Neha       6    NaN
6    Vikas       7   67.0
7     Ritu       8   88.0
8    Pooja       9    NaN
9    Karan      10   72.0

In [22]:
df1['marks'] = df1['marks'].fillna(80)
df1

      name  rollno  marks
0    Ankit       1   85.0
1    Rohan       2   80.0
2  Unknown       3   76.0
3    Suman       4   90.0
4     Aman       5   55.0
5     Neha       6   80.0
6    Vikas       7   67.0
7     Ritu       8   88.0
8    Pooja       9   80.0
9    Karan      10   72.0

In [23]:
m = round(df1['marks'].mean())
df1['marks'] = df1['marks'].fillna(m).astype(int)
df1

      name  rollno  marks
0    Ankit       1     85
1    Rohan       2     80
2  Unknown       3     76
3    Suman       4     90
4     Aman       5     55
5     Neha       6     80
6    Vikas       7     67
7     Ritu       8     88
8    Pooja       9     80
9    Karan      10     72

In [24]:
m = round(df1['marks'].mean())
df1['marks'] = df1['marks'].fillna(m).astype(bool)
df1

      name  rollno  marks
0    Ankit       1   True
1    Rohan       2   True
2  Unknown       3   True
3    Suman       4   True
4     Aman       5   True
5     Neha       6   True
6    Vikas       7   True
7     Ritu       8   True
8    Pooja       9   True
9    Karan      10   True

In [25]:
# forword filling

In [27]:


data = {
    'name': ['Ankit', 'Rohan',None,  'Suman', 'Aman', 'Neha', 'Vikas', 'Ritu', 'Pooja', 'Karan'],
    'rollno': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'marks': [85, None, 76, 90, 55, None, 67, 88, None, 72]
}

df1 = pd.DataFrame(data)

#print(df1)
df1

    name  rollno  marks
0  Ankit       1   85.0
1  Rohan       2    NaN
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6    NaN
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9    NaN
9  Karan      10   72.0

In [28]:
df1['marks']=df1['marks'].bfill()
df1

    name  rollno  marks
0  Ankit       1   85.0
1  Rohan       2   76.0
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6   67.0
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9   72.0
9  Karan      10   72.0

In [29]:


data = {
    'name': ['Ankit', 'Rohan',None,  'Suman', 'Aman', 'Neha', 'Vikas', 'Ritu', 'Pooja', 'Karan'],
    'rollno': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'marks': [None, None, 76, 90, 55, None, 67, 88, None, 72]
}

df1 = pd.DataFrame(data)

#print(df1)
df1

    name  rollno  marks
0  Ankit       1    NaN
1  Rohan       2    NaN
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6    NaN
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9    NaN
9  Karan      10   72.0

In [30]:
df1['marks']=df1['marks'].bfill()
df1

    name  rollno  marks
0  Ankit       1   76.0
1  Rohan       2   76.0
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6   67.0
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9   72.0
9  Karan      10   72.0

In [31]:


data = {
    'name': ['Ankit', 'Rohan',None,  'Suman', 'Aman', 'Neha', 'Vikas', 'Ritu', 'Pooja', 'Karan'],
    'rollno': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'marks': [None, None, 76, 90, 55, None, 67, 88, None, 72]
}

df1 = pd.DataFrame(data)

#print(df1)
df1

    name  rollno  marks
0  Ankit       1    NaN
1  Rohan       2    NaN
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6    NaN
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9    NaN
9  Karan      10   72.0

In [34]:
df1['marks']=df1['marks'].ffill()
df1

    name  rollno  marks
0  Ankit       1    NaN
1  Rohan       2    NaN
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6   55.0
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9   88.0
9  Karan      10   72.0

In [35]:


data = {
    'name': ['Ankit', 'Rohan',None,  'Suman', 'Aman', 'Neha', 'Vikas', 'Ritu', 'Pooja', 'Karan'],
    'rollno': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'marks': [None, None, 76, 90, 55, None, 67, 88, None, 72]
}

df1 = pd.DataFrame(data)

#print(df1)
df1

    name  rollno  marks
0  Ankit       1    NaN
1  Rohan       2    NaN
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6    NaN
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9    NaN
9  Karan      10   72.0

In [36]:
df1['marks']=df1['marks'].ffill().bfill()
df1

    name  rollno  marks
0  Ankit       1   76.0
1  Rohan       2   76.0
2   None       3   76.0
3  Suman       4   90.0
4   Aman       5   55.0
5   Neha       6   55.0
6  Vikas       7   67.0
7   Ritu       8   88.0
8  Pooja       9   88.0
9  Karan      10   72.0